two_caps_fragment = '''Машинально я открыл конверт и прочел несколько строк:

"Глубокоуважаемая Мария Васильевна! Спешу сообщить Вам, что Иван Львович жив и здоров. Четыре месяца назад я, согласно его предписаниям, покинул шхуну, и со мной тринадцать человек команды..."

Я читал — и не верил глазам. Это было письмо штурмана, которое я некогда знал наизусть, которое читал в поездах между Энском и Москвой! Но совсем другое поразило меня. 
"Святая Мария" — прочитал я дальше, — замерзла еще в Карском море. "Святая Мария"! Так называлась шхуна капитана Татаринова. Волнуясь я продолжил чтение:

"Уважаемая Мария Васильевна!" — Мария Васильевна! — "Спешу сообщить Вам, что Иван Львович..." — Иван Львович! Катю зовут Катерина Ивановна!

Тетя Даша решила, что я сошел с ума,
потому что я вдруг коротко заорал и начал с дьявольской быстротой перебирать старые письма. Но я знал, что делал; тетя Даша когда-то читала мне другое письмо, в котором рассказывалось о жизни во льдах, о каком-то матросе, разбившемся насмерть, о том как лед вырубали в каютах.

— Тетя Даша, а все они тут?
— Господи, да что случилось?
— Ничего, тетя Даша! Тут должна быть одна такая штука. Я не слышал себя.

Вот оно:

"Друг мой, дорогая моя, родная Машенька!
Вот уже около двух лет прошло с тех пор, как я послал тебе письмо через телеграфную экспедицию на 174 Югорском Шаре. Но как много с тех пор переменилось. Я тебе и передать, не могу! Начать с того, что тогда мы шли свободно по намеченному курсу, а с октября 1913 года медленно двигаемся на север вместе с полярными льдами.
Таким образом, волей и неволей мы должны были отказаться от первоначального намерения - пройти во Владивосток вдоль берегов Сибири. Но нет худа без добра. Совсем другая мысль теперь занимает меня. Надеюсь, она не покажется тебе — как некоторым моим спутникам — детской или безрассудной..."

Здесь кончался первый лист. Я перевернул его, но на другой стороне ничего нельзя было прочитать, кроме нескольких бессвязных слов, чуть сохранившихся среди подтеков и пятен.

Второй листок начинался с описания шхуны:

"...достигающие местами значительной глубины. Среди одного такого поля и стоит наша "Святая Мария", по самый планшир засыпанная снегом. Временами гирлянды инея срываются с такелажа и с тихим шуршанием осыпаются вниз. Как видишь, Машенька, с горя я стал поэтом. Впрочем, у нас есть и настоящий поэт — наш повар Колпаков. Неунывающая душа! Целыми днями он распевает свою поэму. Вот тебе четыре строчки на память:

Под флагом матушки России
Мы с капитаном в путь пойдем
И обогнем брега Сибири
Своим красавцем кораблем.

Я пишу и перечитываю свое бесконечное письмо и пишу и вижу, что просто болтаю с тобой, а нужно сказать еще так много важного. Я посылаю с Климовым пакет на имя начальника Гидрографического управления. Это мои наблюдения, письма служебные и отчет, в котором изложена история нашего дрейфа. Но на всякий случай пишу и тебе о нашем открытии: к северу от Таймырского полуострова на картах не значится никаких земель.
Между тем, находясь на широте 79го градуса, между меридианами 86 и 87, к востоку от Гринвича, мы заметили резкую серебристую полоску, немного выпуклую, идущую от самого горизонта. Третьего апреля полоска превратилась в матовый щит лунного цвета, а на следующий день мы увидели очень странные по форме облака, похожие на туман, окутавший далекие горы.  Я убежден, что это земля. К сожалению, я не мог оставить корабль в тяжелом положении, чтобы исследовать ее. Но всё впереди. Пока я назвал ее твоим именем, так что на любой географической карте ты найдешь теперь сердечный привет от твоего..."

Здесь кончалась оборотная сторона второго листа. Я отложил его и принялся за третий.

Первые строки были размыты. Потом:

"...Горько подумать, что все могло быть совсем иначе. Я знаю, он будет оправдываться; пожалуй, сумеет убедить тебя, что я один во всем виноват. Молю тебя об одном: не верь этому человеку! Можно смело сказать, что всеми нашими неудачами мы обязаны только ему.
Достаточно, что из шестидесяти собак, которых он продал нам в Архангельске, большую часть еще на Новой Земле пришлось пристрелить. Вот как дорого обошлась нам эта услуга!
Не только я один — вся экспедиция шлет ему проклятия. Мы шли на риск, мы знали, что идем на риск, но мы не ждали такого удара. Остается делать все, что в наших силах. Как много я мог бы рассказать тебе о нашем путешествии!
Для Катюшки хватило бы историй на целую зиму. Но какой ценой приходится расплачиваться, боже мой! Я не хочу, чтобы ты подумала, что наше положение безнадежно. Но вы все-таки не особенно ждите..."
'''
print(two_caps_fragment)