map = 'лхирфбвэзидсэгвйлхфтэйэттмптэчсжыжлч,нмшсбрвъзивжматфьтзсшчжыщэршзбойммпх,лчсниуэтрымчюэлорзюннвючеаычюнхйвмйи,йбсьозпьюэчдгмьмгепьенукхшклтвчиущше,'


m = map.split(',')[0: 4]
print(m)
log = '''
Вперед, Вперед, Вперед, Вперед, Вперед, Вперед, Вправо, Вперед, Вперед, Вперед, Вправо, Вперед, Вправо,
Вперед, Вперед, Влево, Вперед, Вперед, Вперед, Вперед, Вперед, Вперед, Влево, Вперед, Влево,
Вперед, Вперед, Вперед, Вперед, Вперед, Вправо, Вперед, Влево, Вперед, Влево
Вперед, Вперед, Влево, Вперед, Вперед, Вперед, Вперед, Вперед, Вперед, Влево, Вперед, Влево, 
Вперед, Вперед, Вперед, Вперед, Вперед, Вправо, Вперед, Влево, Вперед, Влево
Вперед, Вперед, Влево, Вперед, Вперед, Вперед, Вперед, Вперед, Вперед, Влево, Вперед, Влево, 
Вперед, Вперед, Вперед, Вперед, Вперед, Вправо, Вперед, Влево, Вперед, Влево
Вправо, Вперед, Вперед, Вперед, Вперед, 
Влево, Вперед, Вперед, Вправо, Вперед, Вперед, Вправо, Вперед, Влево, 
Вперед, Вправо, Вперед, Вправо, 
Вперед, Вперед, Вперед, Вперед, Вперед, Вперед, Вперед,
Вперед, Вперед, Вперед, Вправо, Вперед, Влево, 
Вперед, Вперед, Вперед, Вперед, Вперед, Вперед, Вперед, 
Влево,
Вперед, Вправо, Вперед, Вправо, Вперед, Вперед, Влево, 
Вперед, Вперед, 
Вправо, Вперед,
Влево, Вперед,
Влево, Вперед,
Вправо, Вперед,
Вперед, Вправо,
Вперед,
Влево,
Вперед,
Влево, Вперед, Вперед,
Влево, Вперед, Вперед,
Вправо, Вперед,
Влево, Вперед,
Вперед, Вперед, Вперед, Вперед, Вперед, Вперед, 
Вперед, Вперед, Вперед, Вперед, Вперед, Вперед, 
Вперед, Вперед, 
Влево,
Вперед, Вперед, Влево, Вперед, Вперед, Вперед, Вперед, Вперед, Вперед, Влево, Вперед, Влево,
Вперед, Вперед, Вперед, Вперед, Вперед, Вправо, Вперед, Влево, Вперед, Влево
'''
p = log.split(',')

